app/controllers/welcome_controller.rb

SELECT "buildings"."id", "buildings"."name" FROM "buildings"   ORDER BY "buildings"."name" ASC
SELECT "paths"."start", "paths"."end", "paths"."distance" FROM "paths"
SELECT "buildings".* FROM "buildings"  WHERE "buildings"."name" = 'usdan'
---
  def index

		map = CampusMap.new()
		@result = [[42.365965, -71.25981]]
    name_list = Building.order(:name).pluck(:id, :name)
		adjlist = Path.pluck(:start, :end, :distance)
		map.load_map(adjlist)
    @notes = {}
    name_list.sort_by{|id, name| name}.each do |id, name|

SELECT  "nodes".* FROM "nodes"  WHERE "nodes"."id" = ? LIMIT 1  [["id", 1055]]
---
          paths = map.solve(start_id, end_id)
    			@strs = map.solve_text(start_id, end_id)
    			paths.each do |id|
    				node = Node.find(id)